# author by Michealzou@126.com
# 2022/11/8 8:38
"""
岗位练习，经理岗位的名单有曹操、刘备、孙权；技术岗位的有曹操、刘备、关羽、张飞，问
1. 是经理也是技术的有谁？
2. 是经理，不是技术的有谁?
3. 是技术，不是经理的有谁?
4. 张飞是经理吗?
5. 身兼一职的都有谁?
6. 经理和技术总共有都少人?
"""
# 经理
set01 = {"曹操", "刘备", "孙权"}
# 技术
set02 = {"曹操", "刘备", "关羽", "张飞"}
# 1. 是经理也是技术的有谁？
print(set01 & set02)  # {'刘备', '曹操'}
# 2.是经理，不是技术的有谁?
print(set01 - set02)  # {'孙权'}
# 3. 是技术，不是经理的有谁?
print(set02 - set01)  # {'张飞', '关羽'}
# 4. 张飞是经理吗?
print("张飞" in set01)  # False
# 5. 身兼一职的都有谁?
print(set01 ^ set02)  # {'张飞', '关羽', '孙权'}
# 6. 经理和技术总共有都少人?
set03 = set01 | set02
for i in set03:
    print(i)
