"""
    python字符串的索引和切片
        1.索引：所有的字符串拆分的字符都有一个下标
            从第一个字符下标0开始，到n-1结束;
            还可以从最后一个起始，下标为-1，到-n结束
            根据索引可以获取指定的字符:字符串[index]
        2.切片：截取字符串对应的字符
            语法：字符串[start:end:step]
                    start:切片开始的索引
                    end：切片结束的索引
                    step：步长，间隔几个切片
                注意：切片包含start，不包含end-左开右闭
            切片也可以通过反向下标进行切片,顺序也是从左到右
"""
# 索引
str01 = "python"
print(str01[3])
print(str01[-3])
# print(str01[100])  # 下标越界


# 切片 字符串[start:end:step]
str01 = "python"
print(str01[2:4:1])  # 步长为1的情况下可以省略不写
print(str01[2:4:])  # 步长为1的情况下可以省略不写
print(str01[2:4])  # 步长为1的情况下可以省略不写
print(str01[1:4:2])
print(str01[0:6:5])
# th - 负下标
print(str01[-4:-2:1])
# pn - 负下标
print(str01[-6:6:5])

