# author by hliy_ss@163.com
# 2022/3/10 13:48

# 1.打印水仙花数100-1000
# 153 -> 1**3+5**3+3**3=153

A = int(input('请输入起始数:'))
B = int(input('请输入结尾数:'))
for I in range(A, B):
    Q = I % 10  # 个位
    W = I // 10 % 10  # 十位
    E = I // 100  # 百位
    if Q ** 3 + W ** 3 + E ** 3 == I:
        print(f"水仙花数:{I}")

# 2.做一个超市购物判断：100-1000-95，1001-3000-9，3001-5000-8
# 5000-6

# A = int(input("请输入价格:"))
# if 100 <= A <= 1000:
#     print(f"商品折扣为95折，打折后价格为{A * 0.95}")
# elif 1001 <= A <= 3000:
#     print(f"价格{A}的商品折扣为9折，打折后价格为{A * 0.9}")
# elif 3001 <= A <= 5000:
#     print(f"价格{A}的商品折扣为8折，打折后价格为{A * 0.8}")
# elif A >= 5000:
#     print(f"价格{A}的商品折扣为6折，打折后价格为{A * 0.6}")
# else:
#     print(f"价格{A}的商品不打折,价格为{A}")
