# 2022/3/7 21:17
#1.打印水仙花数100到1000
a = int(input("请输入第一个范围："))
b = int(input("请输入第二个范围："))
for c in range(a,b):
    A = c // 100
    B = c // 10 % 10
    C = c % 10
    if c == A ** 3 + B ** 3 + C ** 3:
        print(f'范围内的水仙花数有：{c}')
#2.超市购物
A = int(input("请输入价格:"))
 if 100 <= A <= 1000:
     print(f"价格商品折扣为95折，打折后价格为{A * 0.95}")
 elif 1001 <= A <= 3000:
     print(f"商品折扣为9折，打折后价格为{A * 0.9}")
 elif 3001 <= A <= 5000:
     print(f"商品折扣为8折，打折后价格为{A * 0.8}")
 elif A >= 5000:
     print(f"商品折扣为6折，打折后价格为{A * 0.6}")
 else:
     print(f"商品不打折,价格为{A}")