"""
    练习：
        根据用户输入的值决定打折情况
            300-500--95折
            501-800--9折
            801-1200--8折
            1201-1500--75折
            1500以上-7折
            并输出折后金额
"""
money = int(input("输入购买的金额："))
if 300 <= money <= 500:
    print(f"你的购买金额打95折，折后价为{money * 0.95}")
elif 501 <= money <= 800:
    print(f"你的购买金额打9折，折后价为{money * 0.9}")
elif 801 <= money <= 1200:
    print(f"你的购买金额打8折，折后价为{money * 0.8}")
elif 1201 <= money <= 1500:
    print(f"你的购买金额打75折，折后价为{money * 0.75}")
elif money >= 1501:
    print(f"你的购买金额打7折，折后价为{money * 0.7}")
else:
    print("你的金额不打折")
