# author by Michealzou@126.com
# 2022/11/16 10:41
"""
    实参的传递
        1.位置参数
        2.关键参数
        3.序列参数
        4.字典参数
        形参：定义函数的时候创建的参数
        实参：函数调用的时候传递的真实值
"""
def fun01(a=0, b=0, c=0, d=0):
    print(a)
    print(b)
    print(c)
    print(d)

# 1.按位置传递的实参-位置参数
# fun01(1, 2, 3, 4)
# print("------------")
# 2.参数个数不匹配会报错
# 如果不匹配可以参数关键字参数
# fun01(b=5, d=10)

# 3.序列参数,用*分割序列给形参
list01 = [1, 2, 3, 4]
fun01(*list01)

print("------------")
# 4.字典参数,用**拆分字典
dict01 = {"a": "100", "b": "200", "c": "300", "d": "400"}
fun01(**dict01)
